import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class DocumentHistoryService {

  history: any = history;

  constructor() { }

}

const history = [
  {
    id: 1,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 2,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 3,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 4,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 5,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 6,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 7,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 8,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 9,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 10,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 11,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 12,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 13,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 14,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
  {
    id: 15,
    title: 'Какое-то очень интересное название',
    body: 'Какое-то невероятно интересное краткое содержание',
    phone: +79998887766,
    completed: true,
  },
]
